//1. Вывести в консоль все чётные числа от 0 до 100, включая 0.
// for number in stride(from: 0, through: 100, by: 2) {
//     print(number)
// }

//2. Создать две переменных: одна равна 7, другая 20.
// Если результат перемножения этих переменных больше 10, то вывести в консоль первую переменную, в противном случае вывести вторую.

// var firstNumber = 7
// var secondNumber = 20

// if firstNumber * secondNumber > 10 {
//     print(firstNumber)
// } else {
//     print(secondNumber)
// }

//3. Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечётным числам, если текущее число плюс “k” — чётное, то увеличьте “k” на 2, в противном случае выведите в консоль “Next” и перейдите к следующей итерации.
// var k = 9 // создаем переменную k и задаем ей значение 9

// for i in stride(from: 10, to: 51, by: 1) where i % 2 != 0 { // перебираем диапазон от 10 до 50, берём только нечётные числа
//     if (i + k) % 2 == 0 { // проверяем, является ли сумма текущего числа и k чётной
//         k += 2 // увеличиваем k на 2
//     } else {
//         print("Next") // иначе выводим 'Next' и переходим к следующему числу
//     }
// }

// print(k) // выводим итоговое значение k

//4. Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечётным числам, если текущее число плюс “k” — чётное, то увеличьте “k” на 1, в противном случае выведите в консоль “Next” прекратите выполнение цикла.

// var k = 9 // создадим переменную k и присвоим ей значение 9

// for i in stride(from: 10, to: 51, by: 1) where i % 2 != 0 { // пробегаемся по диапазону от 10 до 50, выбирая только нечётные числа
//     if (i + k) % 2 == 0 { // проверяем, делится ли сумма текущего числа и k нацело на 2 (чётность суммы)
//         k += 1 // если сумма чётная, увеличиваем k на 1
//     } else {
//         print("Next") // если сумма нечётная, выводим в консоль "Next"
//         break // прерываем цикл досрочно
//     }
// }

// print(k) // печатаем итоговое значение k


